app/controllers/facebook_controller.rb

  def index
    #@oauth_url = MiniFB.oauth_url(FB_APP_ID, CALLBACK_URL+"?path=account", # redirect url
    # :scope=>MiniFB.scopes.join(",")+",offline_access,email", :display=>"popup")
    logger.info(params)
    MiniFB.enable_logging
    @uid = ""
    @access_token = ""
    @access_token =  decode_cookie[:access_token]
    @uid =  decode_cookie[:uid]
    @hp_user = Visitor.find_by_fb_user_id(@uid)
---
SELECT * FROM `visitors` WHERE (`visitors`.`fb_user_id` = 0) LIMIT 1

  def new_visitor
    @uid = ""
    @access_token = ""
    val = ""
    cookies.each do |c, v|
      if c=="fbs_"+FB_APP_ID.to_s
        logger.debug(v)
        val = v
      end
    end
    valar = val.split("&")
    logger.debug(valar.length)
    valar.each do |f|
      item = f.split("=")
      if item.length==2
        logger.debug( item[0] + '      ' +  item[1])
        @uid = item[1].chomp('"') if item[0] == "uid"
        @access_token = item[1].chomp('"') if item[0].reverse.chomp('"').reverse == "access_token"
      end
    end
    v = Visitor.new
    v.fb_user_id = @uid
    v.access_token =@access_token
    v.save
---
INSERT INTO `visitors` (`created_at`, `fb_user_id`, `updated_at`, `admin`, `auth_code`, `access_token`) VALUES('2010-07-23 05:42:29', 632510886, '2010-07-23 05:42:29', NULL, NULL, '105093279544714|024fb15986c203e8068ab58c-632510886|KGqnvQyRVsGexUSEcaujgRteeY0.')