app/controllers/facebook_controller.rb

SELECT * FROM `artists` WHERE (`artists`.`fb_user_id` = '632510886') LIMIT 1
---
  def index
    #@oauth_url = MiniFB.oauth_url(FB_APP_ID, CALLBACK_URL+"?path=account", # redirect url
    # :scope=>MiniFB.scopes.join(",")+",offline_access,email", :display=>"popup")
    logger.info(params)
    MiniFB.enable_logging
    @uid = ""
    @access_token = ""
    @access_token =  decode_cookie[:access_token]
    @uid =  decode_cookie[:uid]
    @hp_user = Artist.find_by_fb_user_id(@uid)

UPDATE `pages` SET `updated_at` = '2010-07-24 06:35:56', `allow` = 0 WHERE `id` = 1
---
  def allow_page_admin
    artist_id = params[:artist_id]
    page_id = params[:page_id]
    allow = params[:allow]
    logger.debug(params)
    page = Page.find_by_page_id(page_id)
    page.allow=allow
    page.save

SELECT pages.* FROM `pages` inner join artist_pages AP on AP.page_id = pages.page_id WHERE (AP.artist_id = 100000999791399)
SELECT * FROM `page_publish_pages` WHERE (`page_publish_pages`.`publish_page_id` = '179867002844' AND `page_publish_pages`.`page_id` = 136097313080866) LIMIT 1
DELETE FROM `page_publish_pages` WHERE `id` = 1
INSERT INTO `page_publish_pages` (`created_at`, `publish_page_id`, `updated_at`, `page_id`) VALUES('2010-07-27 06:19:03', 179867002844, '2010-07-27 06:19:03', 136097313080866)
---
  def allow_page
    artist_id = params[:artist_id]
    page_id = params[:page_id]
    allow = params[:allow]
    logger.debug(params)
    pages = Page.find(:all, :select => 'pages.*' , :joins => 'inner join artist_pages AP on AP.page_id = pages.page_id', :conditions=>'AP.artist_id  = ' + artist_id.to_s)
    if allow=='false'
      pages.each do |p|
        logger.debug(p.name)

      ppp = PagePublishPage.find_by_page_id_and_publish_page_id(p.page_id, page_id)
      ppp.destroy
      end
    else
      pages.each do |p|
         logger.debug(p.name)

      ppp = PagePublishPage.new(:page_id => p.page_id, :publish_page_id => page_id)
      ppp.save

SELECT * FROM `pages` LIMIT 1
---
  def post_to_newsfeed

    logger.info('POST TO NEWSFEED')
    posttext = params[:post_text]
    title = params[:post_title]
     logger.info(posttext)
    logger.info(posttext.index('<') )
    posttext = text.split('<')[0]  if posttext.index('<') != nil
    logger.info(posttext)
    logger.info(params)
    fb_page_id = params[:artist_fb_page_id]
    artist_name = params[:track_artist]
    ret = ""
    #pages.each do |p|
    pages=Page.find(:all, :conditions=>"allow=1")
    artist_page = Pages.find_by_name(artist_name)
    fb_page_id = artist_page.id if artist_page != nil
    pages.each do |p|

SELECT * FROM `artists`
SELECT * FROM `pages`
---
  def fb_get_events
    #get events for each artist
    artists = Artist.find(:all)
    logger.debug(artists.length)
    @events = Array.new
    artists.each do |a|
      q="select uid, eid, rsvp_status  from event_member where uid = "+ a.fb_user_id.to_s
      logger.debug(q)
      logger.debug(a.access_token)
      @events = MiniFB.fql(a.access_token, q)
      logger.debug(@events)
      (0..@events.length-1).each do |e|
        sql =<<-SQL
       insert into events (object_id, object_type_id, event_id, rsvp_status) values (#{@events[e].uid},1,#{@events[e].eid},'#{@events[e].rsvp_status}')
        SQL
        r = ActiveRecord::Base.connection.execute sql
      end
    end

    pages = Page.find(:all)
    logger.debug(pages.length)

INSERT INTO `artists` (`created_at`, `fb_user_id`, `updated_at`, `admin`, `auth_code`, `access_token`) VALUES('2010-07-23 05:49:35', 632510886, '2010-07-23 05:49:35', NULL, NULL, '105093279544714|024fb15986c203e8068ab58c-632510886|KGqnvQyRVsGexUSEcaujgRteeY0.')
---
  def new_visitor
    @uid = ""
    @access_token = ""
    val = ""
    cookies.each do |c, v|
      if c=="fbs_"+FB_APP_ID.to_s
        logger.debug(v)
        val = v
      end
    end
    valar = val.split("&")
    logger.debug(valar.length)
    valar.each do |f|
      item = f.split("=")
      if item.length==2
        logger.debug( item[0] + '      ' +  item[1])
        @uid = item[1].chomp('"') if item[0] == "uid"
        @access_token = item[1].chomp('"') if item[0].reverse.chomp('"').reverse == "access_token"
      end
    end
    v = Artist.new
    v.fb_user_id = @uid
    v.access_token =@access_token
    v.save