app/controllers/facebook_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`administrator_id` = '632510886' AND `pages`.`page_id` = '179867002844') LIMIT 1
---
  def allow_page_admin
    artist_id = params[:artist_id]
    page_id = params[:page_id]
    allow = params[:allow]
    logger.debug(params)
    page = Page.find_by_administrator_id_and_page_id(artist_id, page_id)

SELECT * FROM `artist_allowed_pages` WHERE (`artist_allowed_pages`.`artist_id` = '632510886' AND `artist_allowed_pages`.`page_id` = '136097313080866') LIMIT 1
DELETE FROM `artist_allowed_pages` WHERE `id` = 1
INSERT INTO `artist_allowed_pages` (`created_at`, `updated_at`, `page_id`, `artist_id`) VALUES('2010-07-23 10:07:43', '2010-07-23 10:07:43', 179867002844, 632510886)
---
  def allow_page
    artist_id = params[:artist_id]
    page_id = params[:page_id]
    allow = params[:allow]
    logger.debug(params)
    if allow=='false'
      aap = ArtistAllowedPage.find_by_artist_id_and_page_id(artist_id, page_id)
      aap.destroy
    else
      aap = ArtistAllowedPage.new(:artist_id => artist_id, :page_id => page_id)
      aap.save