app/controllers/users_controller.rb

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (username = 'aaron' OR email = 'aaron') AND (users.state = 'active') LIMIT 1